package Tutor;

/*
눈에보이는 모든것들 객체
인간세계
사람 -> 속성 : 키 몸무게 ,기능 : 의사
체중계 -> 속성 : 바늘 눈금 , 기능: 몸무게측정
자전거 -> 바퀴 체인 기능 : 이동수단
승용차 -> 속성 바퀴 엔진 기능 : 이동수단

프로그램에서의 객체

날씨프로그램 속성 : 온도, 미세먼지  기능 : 날씨예보
사칙연산 프로그램 속성 : + - * / 기능 : 연산기능
 객체 : 세상에 존재하는 모든것을 뜻하며 프로그래밍에서 속성과 기능을 가지는 프로그램 단위이다

클래스란?
객체를 생성하기위한 툴로 모든 객체는 클래스로부터 생성된다.

그랜저 속성 : 색상 바퀴, 기능 : 배기량

클래스 = 속성(맴버 변수) + 기능(메소드)

성질이 같은 클래스끼리 모아서 패키지를 만드는게남

중복메소드(오버로딩)
이름은 같고 매개변수의 개수 또는 타입이 다른 메소드를 만들 수있다.


 */


public class ex01 {
    public static void main(String[] args) {

    }
}
